02_openfoam/baseline_SST/NACA0012_AoA00/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    airfoil
    {
        type            zeroGradient;
    }

    inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }

    top
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }

    bottom
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }

    outlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}
