02_openfoam/baseline_SST/NACA0012_AoA00/system/Cp
type            pressure;
libs            ("libfieldFunctionObjects.so");

field           p;
result          Cp;

calcTotal       no;
calcCoeff       yes;

pInf            0;
UInf            (15 0 0);
rhoInf          1;
